src/cf/Reports/СправкаРасчетОбесцененияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>СправкаРасчетОбесцененияЗапасов</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/РасчетОбесцененияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РасчетОбесцененияЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧистаяСтоимостьПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обесценение</Name>
					<Comment>на отчетную дату</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбесценениеВыбытие</Name>
					<Comment>за период расчета</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбесценениеУбыток</Name>
					<Comment>за период расчета</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетРезерва</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗарплаты</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеВзносовОтНесчастыхСлучаев</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПоОплатеТруда</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияИИзносОС</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеВНУАрендныхПлатежей</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмортизацияНМАИсписаниеРасходовПоНИОКР</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходМатериаловДляВыпускаПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПроцентныхРасходов</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаВалютныхСредств</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСтоимостиНоменклатуры</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета97</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговойНаценкиПоПроданнымТоварам</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаИмущество</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТранспортногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗемельногоНалога</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетТорговогоСбора</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеОСДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДопРасходовДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТаможенныхПлатежейДляУСН</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетДолейСписанияКосвенныхРасходов</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетАвансаПоЕдиномуНалоговомуСчету</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов20_23_25_26</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета44</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПоСомнительнымДолгам</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеАвансовВПрочиеДоходыДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляУСН</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеРасходовПоВидамДеятельностиДляИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСтраховыхВзносовИП</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРасходовУменьшающихОтдельныеНалоги</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов90_91</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносУбытковПоНалогуНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаНаПрибыль</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетОтложенногоНалога</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНалогаУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалогаАУСН</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЕНВД</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНДФЛДляИП</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалогаНаПрофессиональныйДоход</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеформацияБаланса</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводОСВМалоценноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаФСБУ25</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаФСБУ6</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходНаФСБУ14</Name>
					<Comment>5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеНалоговНаЕНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаОтложенногоНалога</Name>
					<Comment>6</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/СправкаРасчетОбесцененияЗапасов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область БухгалтерскиеОтчеты

// Описывает свойства отчета (манифест), декларирующий поддержанные в нем возможности подсистемы,
// включая реализованный программный интерфейс.
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Манифест = Новый Структура;
	Манифест.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
	Манифест.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Манифест.Вставить("ИспользоватьПослеКомпоновкиМакета",  Истина);
	Манифест.Вставить("ИспользоватьПриВыводеЗаголовка",     Истина);
	Манифест.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	
	СправкиРасчеты.УстановитьОтчетНеИспользуетНаборыСуммовыхПоказателей(Манифест);
	СправкиРасчеты.УстановитьВариантРасширенногоПервогоНалоговогоПериода(
		Манифест,
		БухгалтерскийУчет.ВариантРасширенногоПервогоНалоговогоПериода());
	
	Возврат Манифест;
	
КонецФункции

Функция ВариантыНастроек() Экспорт
	
	Массив = Новый Массив;
	
	Массив.Добавить(Новый Структура("Имя, Представление", "Основной", НСтр("ru = 'Обесценение запасов'")));
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБухгалтерскиеОтчеты

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПриВыводеЗаголовка.
//
// Параметры:
//  Контекст		 - Структура - контекст, в котором формируется отчет.
//                     См. СправкиРасчеты.КонтекстФормированияОтчета.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - описание связи настроек и схемы отчета.
//  Результат - ТабличныйДокумент - табличный документ с сформированным отчетом.
//
Процедура ПриВыводеЗаголовка(Контекст, КомпоновщикНастроек, Результат) Экспорт
	
	Контекст.ВыполнениеОтчета.Вставить(
		"ОтчетнаяДата",
		КонецМесяца(Контекст.КонецПериода) + 1);
		
	ПериодОтчета = ПериодОтчета(
		Контекст.НачалоПериода,
		Контекст.КонецПериода,
		Контекст.ВыполнениеОтчета.ОтчетнаяДата,
		Контекст.Организация);
		
	Контекст.ВыполнениеОтчета.Вставить("ПериодОтчета", ПериодОтчета);
	
	Если ПериодОтчета = Неопределено Тогда
		Контекст.Вставить("ВыводитьЕдиницуИзмерения", Ложь);
	КонецЕсли;
	
	СправкиРасчеты.ВывестиШапкуОтчета(Результат, Контекст);
	
КонецПроцедуры

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПередКомпоновкойМакета.
//
// Параметры:
//  Контекст			 - Структура - контекст, в котором формируется отчет.
//                         См. СправкиРасчеты.КонтекстФормированияОтчета.
//  Схема				 - СхемаКомпоновкиДанных - схема отчета.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - описание связи настроек и схемы отчета.
//
Процедура ПередКомпоновкойМакета(Контекст, Схема, КомпоновщикНастроек) Экспорт
	
	Если РасчетОтсутствует(Контекст) Тогда
		
		// отменим показ отчета
		Схема.НаборыДанных.Очистить();
		КомпоновщикНастроек.Настройки.Структура.Очистить();
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал", Ложь);
		
		Возврат;
		
	КонецЕсли;
	
	Контекст.ВыполнениеОтчета.Вставить(
		"АктуальныйПереченьОбесцененияЗапасов",
		Документы.ОбесценениеЗапасов.АктуальныйПеречень(Контекст.КонецПериода, Контекст.Организация));
		
	НастроитьПериодОтчета(
		КомпоновщикНастроек,
		Контекст.НачалоПериода,
		Контекст.КонецПериода,
		Контекст.ВыполнениеОтчета.ПериодОтчета);
		
	НастроитьОтборПоОрганизации(КомпоновщикНастроек, Контекст.Организация);
	
	СчетаОбесценения = РегистрыСведений.РасчетОбесцененияЗапасов.СчетаОбесценения();
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"СчетаРезервов",
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(СчетаОбесценения.ВыгрузитьКолонку("СчетРезерва")));
		
	ТекстыЗаголовковГруппКолонок = ЗаголовкиГруппКолонок(Контекст.НачалоПериода, Контекст.ВыполнениеОтчета.ОтчетнаяДата);
	
	БухгалтерскиеОтчеты.УстановитьЗаголовкиГруппКолонок(КомпоновщикНастроек, ТекстыЗаголовковГруппКолонок);
	
КонецПроцедуры

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПослеКомпоновкиМакета.
//
// Параметры:
//  Контекст		 - Структура - контекст, в котором формируется отчет.
//                     См. СправкиРасчеты.КонтекстФормированияОтчета.
//  МакетКомпоновки	 - МакетКомпоновкиДанных - сформированный макет компоновки данных.
//
Процедура ПослеКомпоновкиМакета(Контекст, МакетКомпоновки) Экспорт
	
	Если РасчетОтсутствует(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	СправкиРасчеты.НастроитьГрафыОтчета(МакетКомпоновки, ГрафыОтчета());
	
КонецПроцедуры

// Обработчик события подсистемы БухгалтерскиеОтчеты.
// Вызов определяется параметром ИспользоватьПослеВыводаРезультата.
//
// Параметры:
//  Контекст  - Структура - контекст, в котором формируется отчет.
//              См. СправкиРасчеты.КонтекстФормированияОтчета.
//  Результат - ТабличныйДокумент - табличный документ с сформированным отчетом.
//
Процедура ПослеВыводаРезультата(Контекст, Результат) Экспорт
	
	Если РасчетОтсутствует(Контекст) Тогда
		ВывестиРасчетОтсутствует(Результат, Контекст.КонецПериода);
		Возврат;
	КонецЕсли;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	СправкиРасчеты.ОформитьРезультатОтчета(Результат, Контекст, Ложь);
	
	ВывестиПорядокРасчета(
		Результат,
		Контекст.НачалоПериода,
		Контекст.ВыполнениеОтчета.ОтчетнаяДата,
		Контекст.ВыполнениеОтчета.АктуальныйПереченьОбесцененияЗапасов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТонкаяНастройка

Функция ПериодОтчета(НачалоПериода, КонецПериода, ОтчетнаяДата, Организация)
	
	ПериодРасчета = РегистрыСведений.РасчетОбесцененияЗапасов.ПериодПредыдущегоРасчета(
		ОтчетнаяДата,
		Организация);
		
	Если ПериодРасчета < НачалоМесяца(КонецПериода) Или ПериодРасчета < НачалоПериода Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПериодРасчета;
	
КонецФункции

Функция РасчетОтсутствует(Контекст)
	
	Возврат Не Контекст.ВыполнениеОтчета.Свойство("ПериодОтчета")
		Или Контекст.ВыполнениеОтчета.ПериодОтчета = Неопределено;
	
КонецФункции

Процедура НастроитьПериодОтчета(КомпоновщикНастроек, НачалоПериода, КонецПериода, ПериодРасчета)
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"НачалоОтчетногоПериода",
		НачалоПериода);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"КонецПредыдущегоОтчетногоПериода",
		НачалоМесяца(КонецПериода) - 1);
		
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"ПериодРасчета",
		ПериодРасчета);
	
КонецПроцедуры

Процедура НастроитьОтборПоОрганизации(КомпоновщикНастроек, Организация)
	
	ОписаниеОтбораПоОрганизации = Новый Структура;
	ОписаниеОтбораПоОрганизации.Вставить("Организация",                       Организация);
	ОписаниеОтбораПоОрганизации.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ОписаниеОтбораПоОрганизации, КомпоновщикНастроек);
	
КонецПроцедуры

Функция ГрафыОтчета()
	
	Разделы = Новый Соответствие;
	
	// Заголовки строк
	Разделы.Вставить(
		СправкиРасчеты.СлужебноеИмяЗаголовкиСтрок(),
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НСтр("ru = '1'")));
	
	// "НаНачалоПериода"
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '2'")); // ОбесценениеНачало
	Разделы.Вставить("НаНачалоПериода", ГрафыРаздела);
	
	// "НаКонецПериода"
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '3'")); // Количество
	ГрафыРаздела.Добавить(НСтр("ru = '4'")); // ЦенаПриобретения
	ГрафыРаздела.Добавить(НСтр("ru = '5'")); // Себестоимость
	ГрафыРаздела.Добавить(НСтр("ru = '6'")); // ЧистаяЦенаПродажи
	ГрафыРаздела.Добавить(НСтр("ru = '7'")); // ЧистаяСтоимостьПродажи
	ГрафыРаздела.Добавить(НСтр("ru = '8'")); // ОбесценениеКонец
	ГрафыРаздела.Добавить(НСтр("ru = '9'")); // ОбесценениеКонецПроцент
	Разделы.Вставить("НаКонецПериода", ГрафыРаздела);
	
	// "Изменение"
	ГрафыРаздела = Новый Массив;
	ГрафыРаздела.Добавить(НСтр("ru = '10'")); // Обесценение
	ГрафыРаздела.Добавить(НСтр("ru = '11'")); // ОбесценениеВыбытие
	ГрафыРаздела.Добавить(НСтр("ru = '12'")); // ОбесценениеУбыток
	Разделы.Вставить("Изменение", ГрафыРаздела);
	
	Возврат Разделы;
	
КонецФункции

Функция ЗаголовкиГруппКолонок(НачалоПериода, ОтчетнаяДата)
	
	Периоды = Новый Структура;
	Периоды.Вставить("НаНачалоПериода", НачалоПериода);
	Периоды.Вставить("НаКонецПериода",  ОтчетнаяДата);
	
	Шаблон = НСтр("ru = 'На %1'");
	
	Заголовки = Новый Структура;
	
	Для Каждого ОписаниеПериода Из Периоды Цикл
		Заголовки.Вставить(ОписаниеПериода.Ключ, СтрШаблон(Шаблон, Формат(ОписаниеПериода.Значение, "ДЛФ=D")));
	КонецЦикла;
	
	Возврат Заголовки;
	
КонецФункции

Процедура ВывестиРасчетОтсутствует(ТабличныйДокумент, Период)
	
	Шаблон = ПолучитьМакет("ПорядокРасчета");
	
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("Период",                            ПредставлениеПериода(НачалоМесяца(Период), КонецМесяца(Период)));
	ПараметрыТекста.Вставить("ПредставлениеДокумента",            Метаданные.Документы.ОбесценениеЗапасов.Синоним);
	ПараметрыТекста.Вставить("ПредставлениеРегламентнойОперации", Строка(Перечисления.ВидыРегламентныхОпераций.ОбесценениеЗапасов));
	
	ШаблонРасчетОтсутствует = Шаблон.ПолучитьОбласть("РасчетОтсутствует");
	ШаблонРасчетОтсутствует.Параметры.Заполнить(ПараметрыТекста);
	
	ТабличныйДокумент.Вывести(ШаблонРасчетОтсутствует);
	
КонецПроцедуры

Процедура ВывестиПорядокРасчета(ТабличныйДокумент, НачалоПериода, ОтчетнаяДата, АктуальныйПереченьОбесцененияЗапасов)
	
	Шаблон = ПолучитьМакет("ПорядокРасчета");
	
	// Заголовок
	ШаблонЗаголовок = Шаблон.ПолучитьОбласть("Заголовок");
	ТабличныйДокумент.Вывести(ШаблонЗаголовок);
	
	ДатаДокументаОбесценения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АктуальныйПереченьОбесцененияЗапасов, "Дата");
	Если Не ЗначениеЗаполнено(ДатаДокументаОбесценения) Тогда
		ДатаДокументаОбесценения = ОтчетнаяДата - 1;
	КонецЕсли;
	
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("НачалоПериода",            Формат(НачалоПериода,            "ДЛФ=D"));
	ПараметрыТекста.Вставить("ОтчетнаяДата",             Формат(ОтчетнаяДата,             "ДЛФ=D"));
	ПараметрыТекста.Вставить("ДатаДокументаОбесценения", Формат(ДатаДокументаОбесценения, "ДЛФ=D"));
	ПараметрыТекста.Вставить("ПредставлениеДокумента",   Метаданные.Документы.ОбесценениеЗапасов.Синоним);
	
	ШаблонПорядокРасчета = Шаблон.ПолучитьОбласть("ПорядокРасчета");
	
	ШаблонПорядокРасчета.Параметры.Заполнить(ПараметрыТекста);
	
	ТабличныйДокумент.Вывести(ШаблонПорядокРасчета);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
